app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---
<% if current_user %>
<% @user.attended_events.each do |eve| %>