app/controllers/eventsusers_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def create
    @event = Event.find(params[:event_id])
    @invited_user = User.find(params[:user_id])

    if @event.attendees.include?(@invited_user)