app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (event_date > '2020-06-24 12:43:56.217901')
---
  def index
    @events = Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def show
    @event = Event.find(params[:id])
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @event = User.find(session[:user_id]).events.build

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "events" SET "event" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event", "graduation"], ["description", "convocation"], ["updated_at", "2020-06-17 10:04:11.018903"], ["id", 1]]
INSERT INTO "events" ("event", "description", "created_at", "updated_at", "user_id", "event_date") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = User.find(session[:user_id]).events.build(event_params)
    if @event.event_date < Time.now
      flash.notice = 'cant create a past date event'
      render :new
      return
    end

    respond_to do |format|
      if @event.save

UPDATE "events" SET "event" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event", "graduation"], ["description", "convocation"], ["updated_at", "2020-06-17 10:04:11.018903"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 10]]
---
  def destroy
    @event.destroy